# ExportPatternInfo Class

---
A value used to represent the info stored in the ExportPatternTable.
SystemObject Autodesk.Revit.DBExportPatternInfo
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExportPatternInfo : IDisposable

    Public Class ExportPatternInfo
    	Implements IDisposable

    public ref class ExportPatternInfo : IDisposable

    type ExportPatternInfo =
        class
            interface IDisposable
        end
The ExportPatternInfo type exposes the following members.
| Name| Description
---|---|---
| ExportPatternInfo|  Constructs a new default ExportPatternInfo.
| ExportPatternInfo(ExportPatternInfo)|  Constructs a new copy of the input ExportPatternInfo object.
| ExportPatternInfo(String)|  Constructs a new ExportPatternInfo using the destination pattern name as input.
Top
| Name| Description
---|---|---
| DestinationPatternName|  The destination pattern name (the name of the pattern in the exported format).
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ExportPatternInfo
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace